app/Controllers/Api.php

    function reset_password ( ) {

	    $response = array();

	    $current_user_id = $this->validate_token ( );

	    if ( $current_user_id > 0 ) {

    	    $rules = [
                'password'  => 'required|min_length[8]|max_length[255]'
            ];

    		$input = $this->getRequestInput( $this->request );

            if ( ! $this->validateRequest ( $input, $rules ) ) {
                $response		    = array (
    				'success'	    => 0,
    				'msg'		    => $this->getValidationError ( ),
    				'http_status'	=> ResponseInterface::HTTP_BAD_REQUEST
    			);
            } else {

    			$update_user = array( 'reset_pin' => '', 'password' => $input['password'] );
				$this->UserModel->update ( $current_user_id, $update_user );
---
UPDATE `user` SET `reset_pin` = '', `password` = '$2y$10$X61j4D9iiYzXOGTBSOEwMuLMpYCHgrxg2uO.m.IeVvebVxDga63bi', `updated_at` = '2022-05-31 02:24:15'
WHERE `user`.`id` IN ('2')

    public function logout ( ) {
		$response			= array ( );
		$current_user_id	= $this->validate_token ( );

	    if ( $current_user_id > 0 ) {

            $data = array (
                'device_id'     => '',
                'device_token'  => ''
            );
            $this->UserModel->update( $current_user_id, $data );
---
UPDATE `users` SET `device_id` = '', `device_token` = '', `updated_at` = '2022-06-20 06:08:17'
WHERE `users`.`id` IN ('10')

	public function create_profile ( ) {

		$response	= $data = array ( );
	    $current_user_id	= $this->validate_token ( );

		if ( $current_user_id > 0 ) {

    		$input = $this->getRequestInput ( $this->request );

    		if ( isset ( $_FILES['license_photo'] ) && ! empty ( $_FILES['license_photo']['name'] ) ) {
    			$res = $this->upload_file_on_server ( 'user_files', 'license_photo' );
    			if ( ! empty ( $res ) && ( $res['success'] == 1 ) ) {
    			    $input['license_photo']	= $res['file_name'];
    			} else {
    			    $response				= array (
        				'success'			=> 0,
        				'msg' 			    => $res['msg'],
        				'http_status'		=> ResponseInterface::HTTP_BAD_REQUEST
        			);
        			return $this->output ( $response );
    			}
    	    }

		    if ( ! empty ( $input ) ) {
		        $this->UserModel->update( $current_user_id, $input );
---
UPDATE `user` SET `email` = '99yogesh.sharma@gmail.com', `password` = '$2y$10$Xs8VdMYqESk8R8e1rZ70HeSs7NApIPFbmJ.SvREySQ.j0vRF22AdK', `updated_at` = '2022-06-01 07:51:47'
WHERE `user`.`id` IN ('2')

	public function add_rating ( ) {
	    $response = array();
	    $current_user_id =  $this->validate_token ( );

	    if ( $current_user_id > 0 ) {

    	    $input = $this->getRequestInput ( $this->request );

    		$rules = [
                'booking_id'    => 'required',
                'rating'        => 'required'
            ];

            if ( ! $this->validateRequest ( $input, $rules ) ) {
                $response		    = array (
    				'success'	    => 0,
    				'msg'		    => $this->getValidationError ( ),
    				'http_status'	=> ResponseInterface::HTTP_BAD_REQUEST
    			);
            } else {
                $input['user_id']   = $current_user_id;
                $this->RatingModel->save($input);
---
INSERT INTO `ratings` (`booking_id`, `rating`, `user_id`, `created_at`) VALUES ('1', '3', '2', '2022-06-20 05:23:28')