app/Controllers/Auth.php

INSERT INTO `user` (`email`, `name`, `password`, `device_id`, `device_name`) VALUES ('testdy@test.com', 'yogesh', '$2y$10$UXb8090vmtIa898RCJdoxOE.G4ovjqCGa4buZZFyF.ACUSj7edIke', '1234', 'ios')
---
    public function register () {
        $response = array ();
        $rules = [
            'email'     => 'required|min_length[6]|max_length[50]|valid_email|is_unique[users.email]',
            'password'  => 'required|min_length[8]|max_length[255]'
        ];

        $input = $this->getRequestInput ( $this->request );

        if ( ! $this->validateRequest ( $input, $rules ) ) {
            $response				= array (
				'success'			=> 0,
				'msg'				=> $this->getValidationError ( ),
				'http_status'	    => ResponseInterface::HTTP_BAD_REQUEST
			);
        } else {

            try {

                $this->UserModel->save ( $input );

UPDATE `users` SET `reset_pin` = 9648, `updated_at` = '2022-06-13 07:10:12'
WHERE `users`.`id` IN ('10')
---
	public function forgot_password () {

		$response = array();

	    $rules = [
            'email'     => 'required|min_length[6]|max_length[50]|valid_email'
        ];

		$input = $this->getRequestInput( $this->request );

        if ( ! $this->validateRequest ( $input, $rules ) ) {
            $response		    = array (
				'success'	    => 0,
				'msg'		    => $this->getValidationError ( ),
				'http_status'	=> ResponseInterface::HTTP_BAD_REQUEST
			);
        } else {
			$email = $input['email'];
			$user = $this->UserModel->findUserByEmailAddress ( $email );
			if ( ! empty ( $user )  ) {

			    $rand = rand( 1000, 9999 );

				$user_id = $user['id'];

				$update_user = array ( );
				$update_user['reset_pin'] = $rand;
				$this->UserModel->update ( $user_id, $update_user );

UPDATE `users` SET `email` = 'testsocialaa@gmail.com', `updated_at` = '2022-06-07 01:59:49'
WHERE `users`.`id` IN ('4','','testsocialaa@gmail.com','','','','','','','','','','','','','','','','','','0','2022-06-07 01:57:46','2022-06-07 01:56:36')
UPDATE `users` SET `apple_id` = '23123123', `email` = 'testsocialaa@gmail.com', `updated_at` = '2022-06-07 02:07:34'
WHERE `users`.`id` IN ('4')
INSERT INTO `users` (`facebook_id`, `email`, `created_at`) VALUES ('1919133388475551', 'appsdeveloper22@gmail.com', '2022-06-21 07:06:52')
---
    				    $user	= $this->UserModel->get_user_by_email ( $input['email'] );
    				    if ( ! empty ( $user ) ) {
    				        $current_user_id = $user['id'];
    					    $this->UserModel->update ( $current_user_id, $input );
    				    } else {
    				        $this->UserModel->save ( $input );