app/Models/UserModel.php

    public function findUserById ( string $userId ) {
        $user = $this->asArray()->where(['id' => $userId])->first();
---
SELECT *
FROM `user`
WHERE `id` = '1'
 LIMIT 1

    public function get_user ( $userId ) {
        $user = $this->asArray()->where(['id' => $userId])->first();
---
SELECT *
FROM `users`
WHERE `id` = 12
 LIMIT 1

    public function get_user_by_email ( $email ) {

    	if ( $email ) {
			$user = $this->asArray()->where(['email' => $email])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'appsdeveloper22@gmail.com'
 LIMIT 1